In [1]:
#i√±morts 
#import libraries
import pandas as pd
import numpy as np
import matplotlib as mplot
import seaborn as sns
from scipy import stats
import matplotlib.pyplot as plt
%matplotlib inline
import sklearn

In [4]:
#import estimators
from sklearn.ensemble import RandomForestRegressor
from sklearn.linear_model import LinearRegression
from sklearn.svm import SVR
from sklearn import linear_model

#model metrics
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.model_selection import cross_val_score

#cross validation
from sklearn.model_selection import train_test_split

In [21]:
#data
rawData = pd.read_csv(r'C:\Users\maavila\Documents\CURSO-BigData-DD\Module V\new_credit_o.csv', header =0)
rawData.head()

,Unnamed: 0,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,DEFAULT,AGE2
0,0,20000,female,University,M,2,2,-1,-1,-2,-2,3913,0,689,0,0,0,0,DEFAULT,21-27
1,1,120000,female,University,S,-1,2,0,0,0,2,2682,0,1000,1000,1000,0,2000,DEFAULT,21-27
2,2,90000,female,University,S,0,0,0,0,0,0,29239,1518,1500,1000,1000,1000,5000,PAYS,28-33
3,3,50000,female,University,M,0,0,0,0,0,0,46990,2000,2019,1200,1100,1069,1000,PAYS,34-40
4,4,50000,male,University,M,-1,0,-1,0,0,0,8617,2000,36681,10000,9000,689,679,PAYS,>55

In [22]:
rawData.drop(rawData.columns[0], axis=1, inplace=True)

In [23]:
rawData.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,DEFAULT,AGE2
0,20000,female,University,M,2,2,-1,-1,-2,-2,3913,0,689,0,0,0,0,DEFAULT,21-27
1,120000,female,University,S,-1,2,0,0,0,2,2682,0,1000,1000,1000,0,2000,DEFAULT,21-27
2,90000,female,University,S,0,0,0,0,0,0,29239,1518,1500,1000,1000,1000,5000,PAYS,28-33
3,50000,female,University,M,0,0,0,0,0,0,46990,2000,2019,1200,1100,1069,1000,PAYS,34-40
4,50000,male,University,M,-1,0,-1,0,0,0,8617,2000,36681,10000,9000,689,679,PAYS,>55

In [24]:
rawData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28297 entries, 0 to 28296
Data columns (total 19 columns):
LIMIT_BAL    28297 non-null int64
SEX          28297 non-null object
EDUCATION    28297 non-null object
MARRIAGE     28297 non-null object
PAY_0        28297 non-null int64
PAY_2        28297 non-null int64
PAY_3        28297 non-null int64
PAY_4        28297 non-null int64
PAY_5        28297 non-null int64
PAY_6        28297 non-null int64
BILL_AMT1    28297 non-null int64
PAY_AMT1     28297 non-null int64
PAY_AMT2     28297 non-null int64
PAY_AMT3     28297 non-null int64
PAY_AMT4     28297 non-null int64
PAY_AMT5     28297 non-null int64
PAY_AMT6     28297 non-null int64
DEFAULT      28297 non-null object
AGE2         28231 non-null object
dtypes: int64(14), object(5)
memory usage: 4.1+ MB

In [26]:
rawData.shape

(28297, 19)

In [31]:
count_col = rawData.shape[1]  # gives number of col count
count_col

19

In [33]:
#features
features = rawData.iloc[:,10:17]
print('Summary of feature sample')
features.head()

Summary of feature sample

   BILL_AMT1  PAY_AMT1  PAY_AMT2  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6
0       3913         0       689         0         0         0         0
1       2682         0      1000      1000      1000         0      2000
2      29239      1518      1500      1000      1000      1000      5000
3      46990      2000      2019      1200      1100      1069      1000
4       8617      2000     36681     10000      9000       689       679

In [34]:
#dependent variable
depVar = rawData['PAY_AMT6']

In [43]:
#Training Set (Feature Space: X Training)
X_train = (features[: 20000])
X_train.head()

   BILL_AMT1  PAY_AMT1  PAY_AMT2  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6
0       3913         0       689         0         0         0         0
1       2682         0      1000      1000      1000         0      2000
2      29239      1518      1500      1000      1000      1000      5000
3      46990      2000      2019      1200      1100      1069      1000
4       8617      2000     36681     10000      9000       689       679

In [44]:
#Dependent Variable Training Set (y Training)
y_train = depVar[: 20000]
y_train_count = len(y_train.index)
print('The number of observations in the Y training set are:',str(y_train_count))
y_train.head()

The number of observations in the Y training set are: 20000

0       0
1    2000
2    5000
3    1000
4     679
Name: PAY_AMT6, dtype: int64

In [45]:
#Testing Set (X Testing)
X_test = features[-8000:]
X_test_count = len(X_test.index)
print('The number of observations in the feature testing set is:',str(X_test_count))
print(X_test.head())

The number of observations in the feature testing set is: 8000
       BILL_AMT1  PAY_AMT1  PAY_AMT2  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6
20297     103705      3500      3500      3000      3700     12488       100
20298      65744      2398      2485      2532      2549      2643      3000
20299      19833      2000      2000      2000      5394         0      5000
20300       2978      7000      1951     67101      5142     10316      5720
20301       8868     10006     10018      7011      6000     37000     10000

In [46]:
#Ground Truth (y_test) 
y_test = depVar[-8000:]
y_test_count = len(y_test.index)
print('The number of observations in the Y training set are:',str(y_test_count))
y_test.head()

The number of observations in the Y training set are: 8000

20297      100
20298     3000
20299     5000
20300     5720
20301    10000
Name: PAY_AMT6, dtype: int64

In [47]:
X_train, X_test, y_train, y_test = train_test_split(X_train, y_train)

In [48]:
X_train.shape, X_test.shape

((15000, 7), (5000, 7))

In [42]:
X_train, X_test, y_train, y_test = train_test_split(X_train, y_train)
X_train.shape, X_test.shape

((562, 7), (188, 7))